# -*- org-confirm-babel-evaluate: nil -*-
#+FILETAGS: :project:electronics:microcontroller:
#+html_head: <link rel="stylesheet" type="text/css" href="../../shared/css/article.css"/>
#+options: h:4 num:t toc:t
#+author: J. Rabe
#+email: jonno1.l.r@gmail.com

#+begin_src emacs-lisp :results list :wrap tags :exports results
  org-file-tags
#+end_src

#+DATE: [2023-12-03 Sun 15:12]
#+title: Networked Weather Monitoring Station
#+options: h:4 num:nil toc:t

This is a full stack implementation of a networked weather monitoring station. The repository contains hardware designs, including printed circuit board (PCB) designs for the control and sensor breakout modules, mechanical assembly designs for the custom sensors, embedded sources for the microcontroller, and finally sources for a web API and GUI.

** Testing
After the control module has been programmed, connect the various I2C sensor modules to the 4 pin headers of the breakout module, then connect the breakout module to the sensor module via the RJ11 link. Connect the control module to the network and issue a reset by pressing SW2.

Ensure the static IP address set in the control module source does not clash with other devices on the LAN. This address should be reserved in the router configuration.

From a PC on the LAN, ping the control module address to verify the network connection. If the ping is successful, issue an HTTP GET request and verify that the results look reasonable;

#+begin_src python :session :exports both :results output :cached yes :eval never
  import requests
  from pprint import pprint

  data = requests.get("http://<ip-addr>:1000").json()
  pprint(data)
#+end_src

#+RESULTS:
: {'BME280': [{'id': 96},
:             {'div': 1000, 'temperature': 2863},
:             {'div': 2560, 'pressure': 242870758},
:             {'div': 10240, 'humidity': 743179}],
:  'MCP9808': [{'id': 4}, {'div': 160, 'temperature': 620}]}

Then to extract the actual measurements, divide the result by =div=, as shown below;

#+begin_src python :session :exports both :results output cached yes
  def measPrint(measurement, unit):
      return lambda d: (
          print(
              measurement,
              round(d[measurement] / d["div"], 2),
              unit
          )\
          if measurement in d and 'div' in d\
          else None
      )

  print_temp = measPrint("temperature", "deg C")
  print_hum = measPrint("humidity", "%")
  print_pres = measPrint("pressure", "Pa (un-normalised)")

  for sensor in data:
      print("\n%s"%sensor)
      for meas in data[sensor]:
          print_temp(meas)
          print_hum(meas)
          print_pres(meas)
#+end_src

#+RESULTS:
: 
: BME280
: temperature 2.86 deg C
: pressure 94871.39 Pa (un-normalised)
: humidity 72.58 %
: 
: MCP9808
: temperature 3.88 deg C

The results look valid.

